src/distroless.org
#+TITLE: Minimal production images
#+LANGUAGE: en
#+PROPERTY: header-args:python :tangle no
#+PROPERTY: header-args:bash   :tangle no :dir (expand-file-name ".." default-directory) :results verbatim :cache yes

For production, I want the smallest possible attack surface. Distroless
images have no shell, no package manager — just my application and its
runtime. But I still need the correct timezone.

#+begin_src python :tangle lib/distroless.py :noweb yes
import dagger
from dagger import dag, function


class DistrolessMixin:

    <<distroless-set-tz>>

    <<distroless-python3-debian>>

    <<distroless-debian>>
#+end_src

* Setting the timezone on distroless

  Distroless can't run =apt= or =apk=. We copy the timezone artifacts
  from [[file:alpine.org::*Timezone artifacts for other containers][alpine_tz]] directly into the image — Alpine is lighter than
  Debian and =alpine_tz()= already extracts both =/etc/localtime= and
  =/etc/timezone=.

  [[https://docs.dagger.io/api/reference#definition-Container][.with_file(path, file)]] copies a =File= artifact into the container
  at the given path — like =COPY= in a Dockerfile. This is the only way
  to get files into a distroless image since there is no shell or
  package manager to run.

  #+NAME: distroless-set-tz
  #+begin_src python
  @function
  def distroless_set_tz(self, ctr: dagger.Container) -> dagger.Container:
      """Copy timezone artifacts into a distroless container (uses Lib.timezone)."""
      tz = self.alpine_tz()
      return (
          ctr
          .with_file("/etc/localtime", tz.file("localtime"))
          .with_file("/etc/timezone", tz.file("timezone"))
      )
  #+end_src

* Distroless Python 3

  For Python services that need maximum security and minimum image size.

  #+NAME: distroless-python3-debian
  #+begin_src python
  @function
  def distroless_python3_debian(self) -> dagger.Container:
      """Distroless python3 with timezone set."""
      ctr = dag.container().from_(
          f"gcr.io/distroless/python3-debian{self.debian_version}"
      )
      return self.distroless_set_tz(ctr)
  #+end_src

  #+NAME: distroless_python3
  #+begin_src bash :tangle (daggerlib-auto-test) :comments no :padline no
  dagger call distroless-python-3-debian with-exec --args="python3","-c","import os; print(os.path.exists('/etc/localtime'))" stdout
  #+end_src

  #+RESULTS[27c2be75148473c961ef2961c62a5476c8ecf50d]: distroless_python3
  : True


* Distroless static

  For Go or Rust services compiled as static binaries.

  #+NAME: distroless-debian
  #+begin_src python
  @function
  def distroless_debian(self) -> dagger.Container:
      """Distroless static with timezone set."""
      ctr = dag.container().from_(
          f"gcr.io/distroless/static-debian{self.debian_version}"
      )
      return self.distroless_set_tz(ctr)
  #+end_src

  #+NAME: distroless_static_export
  #+begin_src bash :tangle (daggerlib-auto-test) :comments no :padline no
  TMP="${TMP:-$(mktemp -d)}"
  dagger call distroless-debian file --path="/etc/localtime" export --path="$TMP/out/localtime" > /dev/null
  test -s "$TMP/out/localtime" && echo "non-empty"
  #+end_src

  #+RESULTS[3d90657054fd995231b339ed7b0a37c620a3c7bd]: distroless_static_export
  : non-empty

